modm-ext/data.modm.io/docs/svd/header_stm32l552xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FDCAN_CONFIG</name>
      <description>FD Controller Area Network Configuration</description>
      <groupName>FDCAN_Config</groupName>
      <baseAddress>0x4000a500</baseAddress>
      <registers>
        <register>
          <name>CKDIV</name>
          <description>FDCAN clock divider register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PDIV</name>
              <description>Input Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <description>FDCAN option register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPTR</name>
              <description>Option Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>Universal Serial Bus Full Speed Device</description>
      <groupName>USB</groupName>
      <baseAddress>0x4000d400</baseAddress>
      <interrupt>
        <name>USB_FS</name>
        <description>USB FS global interrupt</description>
        <value>73</value>
      </interrupt>
      <registers>
        <register>
          <name>EP0R</name>
          <description>USB Endpoint 0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP1R</name>
          <description>USB Endpoint 1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP2R</name>
          <description>USB Endpoint 2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP3R</name>
          <description>USB Endpoint 3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP4R</name>
          <description>USB Endpoint 4 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP5R</name>
          <description>USB Endpoint 5 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP6R</name>
          <description>USB Endpoint 6 register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EP7R</name>
          <description>USB Endpoint 7 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CNTR</name>
          <description>Control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ISTR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FNR</name>
          <description>Frame number register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DADDR</name>
          <description>Device address register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BTABLE</name>
          <description>Buffer Table address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>LPMCSR</name>
          <description>LPM Control and Status register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCDR</name>
          <description>Battery Charging detector register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UCPD1</name>
      <description>UCPD</description>
      <groupName>UCPD</groupName>
      <baseAddress>0x4000dc00</baseAddress>
      <interrupt>
        <name>UCPD1</name>
        <description>UCPD1 global interrupt</description>
        <value>106</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG1</name>
          <description>UCPD configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HBITCLKDIV</name>
              <description>Number of cycles (minus 1) for a half bit clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IFRGAP</name>
              <description>Clock divider value to generates Interframe gap</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRANSWIN</name>
              <description>Number of cycles (minus 1) of the half bit clock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PSC_UCPDCLK</name>
              <description>Prescaler for UCPDCLK</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Bypass pre-scaling / divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Pre-scale clock by dividing by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Pre-scale clock by dividing by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Pre-scale clock by dividing by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Pre-scale clock by dividing by 16</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXORDSETEN</name>
              <description>Receiver ordered set detection enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOP</name>
                  <description>SOP Ordered set detection enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP1</name>
                  <description>SOP' Ordered set detection enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP2</name>
                  <description>SOP'' Ordered set detection enabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDRST</name>
                  <description>Hard Reset Ordered set detection enabled</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CABLERST</name>
                  <description>Cable Reset Ordered set detection enabled</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP1_DEBUG</name>
                  <description>SOP' Debug Ordered set detection enabled</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP2_DEBUG</name>
                  <description>SOP'' Debug Ordered set detection enabled</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP_EXT1</name>
                  <description>SOP extension#1 Ordered set detection enabled</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP_EXT2</name>
                  <description>SOP extension#2 Ordered set detection enabled</description>
                  <value>256</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>DMA transmission requests enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>DMA reception requests enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UCPDEN</name>
              <description>USB Power Delivery Block Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>UCPD configuration register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXFILTDIS</name>
              <description>Enables an Rx pre-filter for the BMC decoder</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFILT2N3</name>
              <description>Controls the sampling method for an Rx pre-filter for the BMC decode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCECLK</name>
              <description>Controls forcing of the clock request UCPDCLK_REQ</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUPEN</name>
              <description>Wakeup from STOP enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG3</name>
          <description>UCPD configuration register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIM1_NG_CCRPD</name>
              <description>SW trim value for RPDEFAULT resistors (CC1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRIM1_NG_CC1A5</name>
              <description>SW trim value for RP1A5 resistors (CC1)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIM1_NG_CC3A0</name>
              <description>SW trim value for RP3A0 resistors (CC1)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRIM2_NG_CCRPD</name>
              <description>SW trim value for RPDEFAULT resistors (CC1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRIM2_NG_CC1A5</name>
              <description>SW trim value for RP1A5 resistors (CC1)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIM2_NG_CC3A0</name>
              <description>SW trim value for RP3A0 resistors (CC1)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>UCPD control register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXMODE</name>
              <description>Type of Tx packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Initiate the transfer of a Tx message</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CABLE_RESET</name>
                  <description>Trigger a the transfer of a Cable Reset sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIST_CARRIER2</name>
                  <description>Trigger a BIST test sequence send (BIST Carrier Mode 2)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSEND</name>
              <description>Type of Tx packet</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXHRST</name>
              <description>Command to send a Tx Hard Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXMODE</name>
              <description>Receiver mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal receive mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIST_TEST_DATA</name>
                  <description>BIST receive mode (BIST Test Data Mode)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYRXEN</name>
              <description>Controls enable of USB Power Delivery receiver</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHYCCSEL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Use CC1 IO for power delivery communication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Use CC2 IO for power delivery communication</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANASUBMODE</name>
              <description>Analog PHY sub-mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Rp default</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESISTOR_1_5A</name>
                  <description>Rp 1.5 A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESISTOR_3_0A</name>
                  <description>Rp 3.0 A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No resistor</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAMODE</name>
              <description>Analog PHY working mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SNK</name>
                  <description>Mode SNK Rd</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC</name>
                  <description>Mode SRC Rp</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCENABLE</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Neither PHY is activated (e.g. disabled state of source)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Controls apply to only CC1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Controls apply to only CC1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1CC2</name>
                  <description>Controls apply to both CC1 and CC2 (normal usage for sink/source)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEEXTPHY</name>
              <description>Controls enable of USB Power Delivery transmitter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2VCONNEN</name>
              <description>VCONN enable for CC2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1VCONNEN</name>
              <description>VCONN enable for CC1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBATEN</name>
              <description>Enable dead battery behavior (Active High)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSRXEN</name>
              <description>Enable FRS request detection function</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSTX</name>
              <description>Signal Fast Role Swap request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDCH</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPUSBABSENT</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1TCDIS</name>
              <description>The bit allows the Type-C detector for CC0 to be disabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2TCDIS</name>
              <description>The bit allows the Type-C detector for CC2 to be disabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
